naghm-ayman/Embedded_Systems_projects/PIC18F_Drivers.X/MCAL_layer/I2C/hal_i2c.h
/* 
 * File:   hal_i2c.h
 * Author: Naghm Ayman Omar
 *
 * Created on 13 August 2024, 18:24
 */

#ifndef HAL_I2C_H
#define	HAL_I2C_H

/* --------------------- section of INCLUDES ---------------------*/
#include"pic18f4620.h" 
#include"../mcal_std_types.h"
#include"../../MCAL_layer/GPIO/hal_gpio.h"
#include"../../MCAL_layer/Interrupt/mcal_internal_interrupt.h"

/*--------------------- section of MACRO DECLARATIONS --------------------- */
/* Slew Rate Control bit */
#define SLEW_RATE_DISABLED 1
#define SLEW_RATE_ENABLED  0

/* SMBus Select bit */
#define SMBus_INPUT_ENABLED  1
#define SMBus_INPUT_DISABLED 0

/* Slave Mode Data/Address Indication */
#define I2C_LAST_BYTE_TX_RX_DATA     1
#define I2C_LAST_BYTE_TX_RX_ADRESSS  0

/* Stop Condition Indication */
#define I2C_STOP_BIT_DETECTED      1
#define I2C_STOP_BIT_NOT_DETECTED  0

/* Start Condition Indication */
#define I2C_START_BIT_DETECTED      1
#define I2C_START_BIT_NOT_DETECTED  0

/* I2C : Master or Slave Mode */
#define I2C_MSSP_MASTER_MODE 1
#define I2C_MSSP_SLAVE_MODE  0

/* Master Synchronous Serial Port Mode Select */
#define I2C_SLAVE_MODE_7BIT_ADDRESS                      0x06U
#define I2C_SLAVE_MODE_10BIT_ADDRESS                     0x07U
#define I2C_SLAVE_MODE_7BIT_ADDRESS_SS_INTERRUPT_ENABLE	 0x0EU
#define I2C_SLAVE_MODE_10BIT_ADDRESS_SS_INTERRUPT_ENABLE 0x0FU
#define I2C_MASTER_MODE_DEFINED_CLOCK                    0x08U
#define I2C_MASTER_MODE_FIRMWARE_CONTROLLED              0x0BU

/* General Call Enable bit (Slave mode only) */
#define I2C_GENERAL_CALL_ENABLE   1
#define I2C_GENERAL_CALL_DISABLE  0

/* Master Mode Receive Enable */
#define I2C_MASTER_RECEIVE_ENABLE   1
#define I2C_MASTER_RECEIVE_DISABLE  0

/* Acknowledge Status bit (Master Transmit mode only)*/
#define I2C_ACK_NOT_RECEIVED_FROM_SLAVE 1
#define I2C_ACK_RECEIVED_FROM_SLAVE     0

/* Acknowledge Data bit (Master Receive mode only) */
#define I2C_MASTER_SEND_NOT_ACK 1
#define I2C_MASTER_SEND_ACK     0

/*--------------------- section of MACRO FUNCTIONS DECLARATIONS --------------------- */
/* Slew Rate Enable/Disable */
#define I2C_SLEW_RATE_DISABLE_CFG()         (SSPSTATbits.SMP = 1)
#define I2C_SLEW_RATE_ENABLE_CFG()          (SSPSTATbits.SMP = 0)

/* SMBus Enable/Disable */
#define I2C_SMBus_DISABLE_CFG()             (SSPSTATbits.CKE = 0)
#define I2C_SMBus_ENABLE_CFG()              (SSPSTATbits.CKE = 1)

/* General Call Enable */
#define I2C_GENERAL_CALL_DISABLE_CFG()      (SSPCON2bits.GCEN = 0)
#define I2C_GENERAL_CALL_ENABLE_CFG()       (SSPCON2bits.GCEN = 1)

/* Master Mode Receive Enable */
#define I2C_MASTER_RECEIVE_DISABLE_CFG()    (SSPCON2bits.RCEN = 0)
#define I2C_MASTER_RECEIVE_ENABLE_CFG()     (SSPCON2bits.RCEN = 1)

/* Master Synchronous Serial Port Config */
#define MSSP_MODULE_ENABLE()     ( SSPCON1bits.SSPEN = 1) /* Enables serial port and configures SCK, SDO, SDI and SS as serial port pins */
#define MSSP_MODULE_DISABLE()    ( SSPCON1bits.SSPEN = 0) /*  Disables serial port and configures these pins as I/O port pins */

/* Clock Stretch in Slave Mode */
#define CLOCK_STRETCH_ENABLE()   (SSPCON1bits.CKP = 1)
#define CLOCK_STRETCH_DISABLE()  (SSPCON1bits.CKP = 0)
/*--------------------- section of DATA TYPE DECLARATIONS --------------------- */
typedef struct{
    uint8 i2c_mode_cfg;             /* Master Synchronous Serial Port Mode Select */
    uint8 i2c_slave_address;        /* I2C Slave Address */
    uint8 i2c_mode:1;               /* I2C : Master or Slave Mode */
    uint8 i2c_slew_rate : 1; 		/* Slew Rate Enable/Disable */
	uint8 i2c_SMBus_control : 1; 	/* SMBus Enable/Disable */
	uint8 i2c_general_call : 1;		/* General Call Enable/Disable */
	uint8 i2c_master_rec_mode : 1; 	/* Master Receive Mode Enable/Disable */
	uint8 i2c_reserved : 3; 
#if I2C_INTERRUPT_FEATURE_ENABLE == INTERRUPT_FEATURE_ENABLE
    interrupt_priority_cfg I2C_bc_priority;
    interrupt_priority_cfg I2C_priority;
#endif
}i2c_config_t;
typedef struct{
    uint32 i2c_clock;        /* Master Clock Frequency */
    i2c_config_t i2c_config; /* I2C Configurations */
#if I2C_INTERRUPT_FEATURE_ENABLE == INTERRUPT_FEATURE_ENABLE
    void (*I2C_Report_Write_Collision)(void);	/* Write Collision Indicator */
    void(* I2C_InterruptHandler)(void);         /* Default Interrupt Handler */
    void (*I2C_Report_Receive_Overflow)(void); 	/* Receive Overflow Indicator */
    interrupt_priority_cfg priority;
#endif
}mssp_i2c_t;
/*--------------------- section of SOFTWARE INTERFACES DECLARATIONS --------------------- */
Std_ReturnType MSSP_I2C_Init(const mssp_i2c_t *i2c_obj);
Std_ReturnType MSSP_I2C_DeInit(const mssp_i2c_t *i2c_obj);

Std_ReturnType MSSP_I2C_Master_Send_Start(const mssp_i2c_t *i2c_obj);
Std_ReturnType MSSP_I2C_Master_Send_Repeated_Start(const mssp_i2c_t *i2c_obj);
Std_ReturnType MSSP_I2C_Master_Send_Stop(const mssp_i2c_t *i2c_obj);

Std_ReturnType MSSP_I2C_Master_Write_Blocking(const mssp_i2c_t *i2c_obj, uint8 i2c_data, uint8 *_ack);
Std_ReturnType MSSP_I2C_Master_Read_Blocking(const mssp_i2c_t *i2c_obj, uint8 ack, uint8 *i2c_data);

Std_ReturnType MSSP_I2C_Master_Write_NBlocking(const mssp_i2c_t *i2c_obj, uint8 i2c_data, uint8 *_ack);
Std_ReturnType MSSP_I2C_Master_Read_NBlocking(const mssp_i2c_t *i2c_obj, uint8 ack, uint8 *i2c_data);

#endif	/* HAL_I2C_H */

